<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"bd104c6e7247c5fd373523ec0a5076ec069427f9154f340d17b05732f4098a1e","plan_job_ref":"Job Create terraform plan #37 at https://github.com/presentium/infrastructure/actions/runs/10304499661","plan_out_hash":"97f0db96127e9dafd94aa450108dcfae4d3c4be52cf0e130386099d6efb7d952","plan_hash":"e818ad5da12490e07710cc00a67fca9a0de2044c9d2275c91950ccbae4be15ee","plan_text_format":"diff","version":"1.44.0","closed":true} -->
Terraform plan in __infrastructure__
<details>
<summary>Plan: 2 to add, 9 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.vpc.data.aws_subnets.private_subnets_primary_cidr will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_subnets" "private_subnets_primary_cidr" {
+       id   = (known after apply)
+       ids  = (known after apply)
+       tags = (known after apply)

+       filter {
+           name   = "cidr-block"
+           values = [
+               "10.0.4.0/24",
+               "10.0.5.0/24",
+               "10.0.6.0/24",
            ]
        }
    }

  # module.vpc.data.aws_subnets.private_subnets_secondary_cidr will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_subnets" "private_subnets_secondary_cidr" {
+       id   = (known after apply)
+       ids  = (known after apply)
+       tags = (known after apply)

+       filter {
+           name   = "cidr-block"
+           values = [
+               "100.64.0.0/20",
+               "100.64.16.0/20",
+               "100.64.32.0/20",
            ]
        }
    }

  # module.vpc.module.vpc.aws_subnet.private[0] will be updated in-place
!~  resource "aws_subnet" "private" {
        id                                             = "subnet-0adf718c6f276a540"
!~      tags                                           = {
            "Name"                            = "presentium-private-eu-west-1a"
            "karpenter.sh/discovery"          = "presentium"
+           "kubernetes.io/role/internal-elb" = "1"
        }
!~      tags_all                                       = {
+           "kubernetes.io/role/internal-elb" = "1"
#            (3 unchanged elements hidden)
        }
#        (19 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.private[1] will be updated in-place
!~  resource "aws_subnet" "private" {
        id                                             = "subnet-0b0fb261c1aa2a51a"
!~      tags                                           = {
            "Name"                            = "presentium-private-eu-west-1b"
            "karpenter.sh/discovery"          = "presentium"
+           "kubernetes.io/role/internal-elb" = "1"
        }
!~      tags_all                                       = {
+           "kubernetes.io/role/internal-elb" = "1"
#            (3 unchanged elements hidden)
        }
#        (19 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.private[2] will be updated in-place
!~  resource "aws_subnet" "private" {
        id                                             = "subnet-006128dd848559b02"
!~      tags                                           = {
            "Name"                            = "presentium-private-eu-west-1c"
            "karpenter.sh/discovery"          = "presentium"
+           "kubernetes.io/role/internal-elb" = "1"
        }
!~      tags_all                                       = {
+           "kubernetes.io/role/internal-elb" = "1"
#            (3 unchanged elements hidden)
        }
#        (19 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.private[3] will be updated in-place
!~  resource "aws_subnet" "private" {
        id                                             = "subnet-0da26b22c86f4b2b8"
!~      tags                                           = {
            "Name"                            = "presentium-private-eu-west-1a"
            "karpenter.sh/discovery"          = "presentium"
+           "kubernetes.io/role/internal-elb" = "1"
        }
!~      tags_all                                       = {
+           "kubernetes.io/role/internal-elb" = "1"
#            (3 unchanged elements hidden)
        }
#        (19 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.private[4] will be updated in-place
!~  resource "aws_subnet" "private" {
        id                                             = "subnet-051408f2921d9c4f4"
!~      tags                                           = {
            "Name"                            = "presentium-private-eu-west-1b"
            "karpenter.sh/discovery"          = "presentium"
+           "kubernetes.io/role/internal-elb" = "1"
        }
!~      tags_all                                       = {
+           "kubernetes.io/role/internal-elb" = "1"
#            (3 unchanged elements hidden)
        }
#        (19 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.private[5] will be updated in-place
!~  resource "aws_subnet" "private" {
        id                                             = "subnet-0381bfb78583d2908"
!~      tags                                           = {
            "Name"                            = "presentium-private-eu-west-1c"
            "karpenter.sh/discovery"          = "presentium"
+           "kubernetes.io/role/internal-elb" = "1"
        }
!~      tags_all                                       = {
+           "kubernetes.io/role/internal-elb" = "1"
#            (3 unchanged elements hidden)
        }
#        (19 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.public[0] will be updated in-place
!~  resource "aws_subnet" "public" {
        id                                             = "subnet-0305fbf85f82b657a"
!~      tags                                           = {
            "Name"                   = "presentium-public-eu-west-1a"
+           "kubernetes.io/role/elb" = "1"
        }
!~      tags_all                                       = {
+           "kubernetes.io/role/elb" = "1"
#            (2 unchanged elements hidden)
        }
#        (19 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.public[1] will be updated in-place
!~  resource "aws_subnet" "public" {
        id                                             = "subnet-058ff1139a137115e"
!~      tags                                           = {
            "Name"                   = "presentium-public-eu-west-1b"
+           "kubernetes.io/role/elb" = "1"
        }
!~      tags_all                                       = {
+           "kubernetes.io/role/elb" = "1"
#            (2 unchanged elements hidden)
        }
#        (19 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.public[2] will be updated in-place
!~  resource "aws_subnet" "public" {
        id                                             = "subnet-065a7d977b888ebdf"
!~      tags                                           = {
            "Name"                   = "presentium-public-eu-west-1c"
+           "kubernetes.io/role/elb" = "1"
        }
!~      tags_all                                       = {
+           "kubernetes.io/role/elb" = "1"
#            (2 unchanged elements hidden)
        }
#        (19 unchanged attributes hidden)
    }

  # module.eks.module.eks.module.fargate_profile["karpenter"].aws_eks_fargate_profile.this[0] must be replaced
-/+ resource "aws_eks_fargate_profile" "this" {
!~      arn                    = "arn:aws:eks:eu-west-1:123247571664:fargateprofile/presentium/karpenter/d2c89779-4fe7-024e-70c4-de638f4a911b" -> (known after apply)
!~      id                     = "********************" -> (known after apply)
!~      status                 = "ACTIVE" -> (known after apply)
!~      subnet_ids             = [ # forces replacement
-           "subnet-0381bfb78583d2908",
-           "subnet-051408f2921d9c4f4",
-           "subnet-0da26b22c86f4b2b8",
        ] -> (known after apply) # forces replacement
        tags                   = {
            "karpenter.sh/discovery" = "presentium"
        }
#        (4 unchanged attributes hidden)

-       selector {
-           labels    = {} -> null
-           namespace = "karpenter" -> null
        }
+       selector {
+           namespace = "karpenter"
        }

#        (1 unchanged block hidden)
    }

  # module.eks.module.eks.module.fargate_profile["kube-system"].aws_eks_fargate_profile.this[0] must be replaced
-/+ resource "aws_eks_fargate_profile" "this" {
!~      arn                    = "arn:aws:eks:eu-west-1:123247571664:fargateprofile/presentium/kube-system/78c89779-315a-9d88-e80e-f8836b8a4152" -> (known after apply)
!~      id                     = "**********************" -> (known after apply)
!~      status                 = "ACTIVE" -> (known after apply)
!~      subnet_ids             = [ # forces replacement
-           "subnet-0381bfb78583d2908",
-           "subnet-051408f2921d9c4f4",
-           "subnet-0da26b22c86f4b2b8",
        ] -> (known after apply) # forces replacement
        tags                   = {
            "karpenter.sh/discovery" = "presentium"
        }
#        (4 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

Plan: 2 to add, 9 to change, 2 to destroy.
```
</details>

:white_check_mark: Plan applied in [Apply terraform plan #19](https://github.com/presentium/infrastructure/actions/runs/10304518988)
<details><summary>Outputs</summary>

```hcl
eks_db_irsa_arns      = {
    api-prod    = "arn:aws:iam::123247571664:role/PRES-DB-API-PROD-PRESENTIUM"
    api-staging = "arn:aws:iam::123247571664:role/PRES-DB-API-STAGING-PRESENTIUM"
    authentik   = "arn:aws:iam::123247571664:role/PRES-DB-AUTHENTIK-PRESENTIUM"
}
eks_sops_kms_role_arn = "arn:aws:iam::123247571664:role/PRES-SOPS-KMS-PRESENTIUM"
iam_users             = {
    Christophe = "wcFMA9jYz27SnaN8AQ//ZT2pMcOraPFseG75f0xu6kVY6KLG/6fPzIBo49QLyZfbaA4RUQmzJ+UoUiptqfpTkH9AS6PPqAJuGFL20Zfa+3L0gKG7IJKkX81F6rAbtlA+WA5UW8BcQE/O5ANlsHv1H4wq8CnUS/q6NNjAqnEedDrcPWl1m6B197ajVHLl5ffqltVG4txXnCSzA3Htb44EW26eHp+PJgoicXGGmm/FQ/U6j9ScJlBnhM8mXVdwUpu43+ENo6gn6LUcC0Kd7WkSFBmMBjMdQVLDSUFzf0Ry6lwJvLIdab+N9ipcwJTgVQL4rrMZRXs7lhtg+aLw0TX7gVWNX0qwky/wc1i4vu/BP9giB4qJUEBsmdKyjlLiMk219zhTFyS5iGHzgx4qI8mFl+/qkIAAkO2nRIPL5E1alMeAjW0I9415yN8hq2qHYGnvJqVQHU7ZkgUkiHy4SVByla8vF+quZC88nZsFviP0DLTX174zUnWuyi3E//tjmiY01PTBzf7gHw7tGB1NrkbPnpBKvxM/UhnyLo4jG6iuiRA9EOApF1mn0pn9mDeCLHZQSyaGypZlpL7SsLvVL+0D+AKcXLOfoAxc/bqqp7U+yvFot4etrVQlfw8Rdic2FMsqwJcAwq64RZApvv49D34P27GowKfVNVv8qptxLAuukSfm8RgWLEVE4GOIz1Ec0H3SRQGk3U1SMudNCND5FqQwhoBWMWRH8sJnPnaI8x3HgPG7P8eJFAluwrER/CgylPqNDTWotJOdbYnTZ71JYTw86QKSN9ooAg=="
    Lea        = "wcFMA9jYz27SnaN8AQ//bU+rwTu+l2L+3NnqGmF2dPHNjJA793P/PNFlDX7GZggzWJqkhYW4cfqrSm7o1J1+T2XgkfWGVV+9BPAMmK+4rg5lVG6I03CXS+HLAJG2FkdYCdQZoJ7ZiN00F6TblWbBeX1pwVJ2UHMF9FdwCwsTvLDmHfpZnpl5nth6vF9rb1j9AE0X3RUjI9hVn6GAxIhINKUTcDQtUV4eE+rc3HnO6jk5UO1S+xQbkd3LNurePG+KaWeQXmRaaDpTajXrNXfp4qGbnsstBwZLzCLrtp6xt7IoMmr4HIhSlerXDQ3ktTH1SYLqecbNbvveqj0HHcjNoF7KtBSWs9iTZUsQ0gWCrka31Pm2GXLS96LwlJwGCVfpnDyAMy7uBPjQriywuXT8+zmu1EbzcxbhO8B2iohyRXLRjW0oZLtIX/8HNWNXGoK1IkhmAnnOQ9oN6YcgifkciD+n/eWXIEvOlPiiJl6ZmQ4tYJd4EtoSTZdlCk8olCIugW06bivKLoKWC0qabnLc4bB+imyxbGixqS9P0LrO/chQW7Q7dg4U5obN5vQ83xzP4hU3jk1J+Za9BW0uRTmUdEjZgIFh8dg7HjPNyh80+tVQEHgqHJwqXKCfoD+hQ9YKlgJcjng9PhxPlQ5xwHe03U1uRo7mCFceR3QEB5fYp0ICaUBpwu5tEFguw0lbI6HSRQGkDwHxDlY8fSoNl4oJQJK0bwvEZU+XF5gKdjpOi57BtPlBslGULyj42IXyTJ5Plp4/QcZtSeent6YE+BfcBSZxf793pQ=="
    Loic       = "wcFMA92wPHuZJ5FBAQ//Q770nuaNLqmnh2AweJDvGUjlvq8oQl8rNUmR9GMTtSNpygHinsozhkTQJt2kco1HopTRtL/Y6euHTm34IvDCz+Xru0X0HIwYluU6+bHmHtmoiGWBqSZeKl2Aw/GTQ3NQuYxCg80yrsdKuD9sG9MY1Zvw5LW+bmzTD2hEdXru3UdfHJRY8bzOddbS3One/yqzcQNNF8/Rhba78EneygxrtMgiNN02oKM2z2sxUehJE+z3/1sJqr2iRg2mSZJPb4KG7Vv2H+3/Nk6FD9NqGen0OIbBDxUb5VLm7GtBGeMe3Vc7zVHFiYAItNOV5LG61nWptVLfha4y4dJDcEznrAVOlzrZd7jUmuj8j/TVNWtCA8x6MwcAOlEdBHbx0lAZTNIPWy3RHQt5gYwbGjhngTY5m6lshi/p30v+qtfNFIAbOEdBg5SvqssmPIiKJqqil/A/lPbaTx25p6yCrfsv4WBjQtxbcKO2Q/Lj2Gm/O/jaWLxBnuNJh3IudbkpcPQyqpMCgRic6QhG81gTXDqfo759UAOiKW9NdUmnBWc/J8U29bJqOUZnR40ib4lJBh81Q9hP3A08l1ZwJfdANHPqez3MYLmddIY42s5tfShpbWwQwxtEgPb0zYYomSZ0pOZzH1iphnIG+VT8eDf1WLkg5GkyLmCgQ2iCvvNmCnzrq4g2y8bSRQHFq2kaL7TWy28VlRK5Fugbw2aR1yRqZ+s+2MzOVlObxwzJbp826Deou+sh9keglgp943f+MzKN9Cw8g4UTY058C3KhhQ=="
    Massimo    = "wcFMA9jYz27SnaN8AQ/8DD7S+UrqA/q1GjWnjineRn71eNBZOcWXvGvesSEh8iAEkG7grVkvLYdhNAl87G8UNBKSYzvnkqs4pKxfFE6Su8Vqf+FIeU4D6BuKaSFAfU4H210v0sc7zAWKecby/ZuM5GXKyeNezVz85MtUlvyhjpsq0TnHm/Mlw0iwx9IiM1tGM1mtC9fLzPiXVvIw0Jd3Wqv3wE76eYABkN81ptxZctBnrNi/D1htbwSq2jFvWjewFBtlADerO4jOTtbOwjVOThUf6dTc7ZoP1djRx+7ggOvxiWSGLwND0DMChcM6ustk8vjrTaZA3tWkLWSkJzCFQWEJQ4bbQfZQX5Mj9Fx6yRyI5R/Q/KhB2PSbZL8IamGWwN1tbgvfrJbIjamOGfW+Z+riTC54MZTPI2ycLY/nyVBKvGKtznowwizao1gjOnLu8KcDI+VukypA1tmQtnugXxaJ7GfaVN9A867caZP3WAJ0/Tor7yLAjrLD9USADN7NQmTWr5jcxhjkrsrLYGO34mh912RrtN1WsqtoCQ373tk7fW+Vg++myHp7zqSL0LfeY90iMHQxlTJRbnrkv0SKdbKvBmR2GReS7ngafWbjULRNbs8zUgui5jCMZ1Y/U6QEQagR99PKOYvL7+Gcc7Ki6cBD8Wrq+1aEtahvC02uWtJXKcy3QpJVEW/abYhTVW3SRQHCv7c5lzpVtM47lUv+R+Xg0PxwMTZ4iI/kutoDvc526jkeV3kpdBNYsRfkThCqfzZ20sqXj7bSATLKrpS/xQINvS0ZIQ=="
    Sacha      = "wcFMA9jYz27SnaN8AQ/9EfFcDhgMWgN76uCIYx2qxMOgAveb24I4Bq05Ipe0YZzpuXF8HH25a3E/w0wzTE8r8ev4Z2JnarRAesnq9XooitCWcC9ncxYPtBbcWlYDHf8TPTTOXyIRUFIw4y/5us7Jkrvu3TWB1vu0YrfB0H1XtOTYd7NN6GkImLDyPg8uIWqXseYHxYdiV+s+8mZlhJ3Z3tucNBoWwOEMQ/Yzwk2Nrvh1lYdCSCnMY4/c3Vv2QsU/qkLzX4L5w3ZEm/hmWIw8MI4/XJUyPXFk/Sl1VKXYUNobA6/LBeNWQCW+6e6sTYo1yeFG5A/qE0LpchmGtq7K/66t8APY2vJ7UZ1cpzd8KLPChicYaJIYC+Riaj6WdUGNOU+9GaZ8XZIbGhM7iLbJYutrOLStD/KkMDa6PIVkWF/7ohXmiZsDSuU1a1GO8nSTRhFwdaxiKLTXG4NiFEDo/sGE+DoabzkOVdx0zdm4UCQQ3jwnO9F2LJHTf6fQnN4WtLCaP2PN0DZo5dGtS7MOVl+O+gtF6dx1/DfJ95B96dvBfs2COJjAFZY8guXu7cIcz74JmM/CYkw8PFKB9guK2i4H4qSMk3dKYcKc6EId6Lduy1HEPC9Lje/qRaKdESBdi5xZ1Wo3GYGeHgQPfldr7XddBb973InbVCk6bKeXmwmDAWZtJx7K+hnrsA5FLfPSRQGF232XngZDXyd6PRk3bJdCib5DiJHMxYUPM0ZDAFlLr6aa7pOJiOt9nnHy+1cRXthml+la6b9UpZ6JjFR69HMR07NsVQ=="
}
```
</details>